/*********************************Copyright (c)*********************************
**                               
**
**--------------File Info-------------------------------------------------------
** File Name:               sim_i2c.h
** Last modified Date:      
** Last Version:            
** Description:             i2cÅäÖÃÎÄ¼þ
**
**------------------------------------------------------------------------------
** Created By:              wanxuncpx
** Created date:            
** Version:                 
** Descriptions:            
**
*******************************************************************************/

/******************************************************************************
¸üÐÂËµÃ÷:
    
******************************************************************************/

/******************************************************************************
*********************************  Ó¦ ÓÃ ×Ê ÁÏ ********************************
******************************************************************************/


#ifndef _SIM_I2C_H_
#define _SIM_I2C_H_

#ifdef __cplusplus
 extern "C" {
#endif
/******************************************************************************
********************************* ÎÄ¼þÒýÓÃ²¿·Ö ********************************
******************************************************************************/
#include "stm32f10x.h"
#include <stdbool.h>


/******************************************************************************
********************************** ²ÎÊýÅäÖÃ ***********************************
******************************************************************************/
/*---------------------*
*    A- Êý¾ÝÀàÐÍ¶¨Òå   * 
*----------------------*/
//none
/*
typedef uint8_t       uint8_t ;   // ÖØ¶¨Òå8Î»ÎÞ·ûºÅÕûÐÎÊý¾ÝÀàÐÍ
typedef unsigned int        uint16_t;   // ×¢ÒâMCS51 intÀàÐÍÕ¼2¸ö×Ö½Ú
typedef unsigned long       uint32_t;
typedef signed char         int8_t  ;
typedef signed int          int16_t ;
typedef signed long         int32_t ;
*/

/*---------------------*
*    B- ´íÎó´úÂëÁÐ±í   *
*----------------------*/
//none
/*---------------------*
*   C- °æ±¾ÓëÏµÍ³ÐÅÏ¢  *
*----------------------*/
//none
/*---------------------* 
*    D- Ð¾Æ¬Ê±ÖÓÉè¶¨   * 
*----------------------*/
//none
/******************************************************************************
********************************** Ðè×Ô¶¨Òå ***********************************
****************************** ²ÎÊýÅäÖÃ¡¢Òý½Å¶¨Òå  ****************************
******************************************************************************/
//************************** ICCÒý½Å *********************************
//´«¸ÐÆ÷I2C
#define AHRS_I2C                    I2C1
#define AHRS_I2C_GPIO               GPIOB
#define AHRS_I2C_CLK                RCC_APB1Periph_I2C1
#define AHRS_I2C_GPIO_CLK           RCC_APB2Periph_GPIOB
#define AHRS_I2C_SclPin             GPIO_Pin_6
#define AHRS_I2C_SdaPin             GPIO_Pin_7
/***** ²Ù×÷ºê¶¨Òå *****/
#define SCL_H         (AHRS_I2C_GPIO->BSRR = AHRS_I2C_SclPin)
#define SCL_L         (AHRS_I2C_GPIO->BRR  = AHRS_I2C_SclPin)    
#define SDA_H         (AHRS_I2C_GPIO->BSRR = AHRS_I2C_SdaPin)
#define SDA_L         (AHRS_I2C_GPIO->BRR  = AHRS_I2C_SdaPin)
#define SCL_read      (AHRS_I2C_GPIO->IDR  & AHRS_I2C_SclPin)
#define SDA_read      (AHRS_I2C_GPIO->IDR  & AHRS_I2C_SdaPin)


//********************** ¶¨ÒåLEDÐÅºÅÖ¸Ê¾µÆ(Êä³ö) ********************
#define LED1_GPIO_PORT              GPIOA       //L1ÐÅºÅÖ¸Ê¾
#define LED1_GPIO_CLK               RCC_APB2Periph_GPIOA 
#define LED1_GPIO_PIN               GPIO_Pin_15
#define LED2_GPIO_PORT              GPIOB       //L2ÐÅºÅÖ¸Ê¾
#define LED2_GPIO_CLK               RCC_APB2Periph_GPIOB 
#define LED2_GPIO_PIN               GPIO_Pin_3
/***** ²Ù×÷ºê¶¨Òå *****/
#define LED1_ON()                   {LED1_GPIO_PORT->BRR  = LED1_GPIO_PIN;}
#define LED1_OFF()                  {LED1_GPIO_PORT->BSRR = LED1_GPIO_PIN;}
#define LED1_DIV()                  {LED1_GPIO_PORT->ODR ^= LED1_GPIO_PIN;}
#define LED2_ON()                   {LED2_GPIO_PORT->BRR  = LED2_GPIO_PIN;}
#define LED2_OFF()                  {LED2_GPIO_PORT->BSRR = LED2_GPIO_PIN;}
#define LED2_DIV()                  {LED2_GPIO_PORT->ODR ^= LED2_GPIO_PIN;}


//*********************** Ãæ°å°´¼ü(ÊäÈë)******************************
#define KEY_GPIO_PORT               GPIOB       //°´ÏÂÎª¸ß,¿ÕÏÐÎªµÍ
#define KEY_GPIO_CLK                RCC_APB2Periph_GPIOB  
#define KEY_GPIO_PIN                GPIO_Pin_2
/***** ²Ù×÷ºê¶¨Òå *****/
#define KEY_IS_H                    (KEY_GPIO_PORT->IDR & KEY_GPIO_PIN)
#define KEY_IS_L                    (!(KEY_GPIO_PORT->IDR & KEY_GPIO_PIN))

/******************************************************************************
******************************* ×Ô¶¨Òå²ÎÊýÅäÖÃ ********************************
******************************************************************************/
//none
#define I2C_DELAY_VAL   2    //30¶ÔÓ¦100K,¾­²âÊÔ×îµÍµ½4»¹ÄÜÐ´È,È¡Öµ[7..255]
                             //4¶ÔÓ¦400K
                                                          

/******************************************************************************
******************************** Êý¾ÝÀàÐÍ¶¨Òå *********************************
******************************************************************************/
//none

/******************************************************************************
********************************* Êý ¾Ý Éù Ã÷ *********************************
******************************************************************************/
/*---------------------* 
*    IMPORT:ÓÉÍâÌá¹©   * 
*----------------------*/
//none

/*---------------------* 
*    EXPORT:ÏòÍâÌá¹©   * 
*----------------------*/
//none

/******************************************************************************
********************************* º¯ Êý Éù Ã÷ *********************************
******************************************************************************/
/*---------------------* 
*    IMPORT:ÓÉÍâÌá¹©   * 
*----------------------*/
//none

/*---------------------* 
*    EXPORT:ÏòÍâÌá¹©   * 
*----------------------*/
//I2CÍêÕû¶ÁÐ´º¯Êý
extern void    I2C_Ini(void);               //ÅäÖÃI2C½Ó¿Ú
extern bool    Single_Write(uint8_t SlaveAddress,uint8_t REG_Address,uint8_t REG_data);
extern uint8_t Single_Read(uint8_t SlaveAddress,uint8_t REG_Address);
extern bool    Fast_Write(uint8_t SlaveAddress,uint8_t REG_Address,uint8_t REG_data);
extern bool    Mult_Read(uint8_t SlaveAddress,uint8_t REG_Address,uint8_t * ptChar,uint8_t size);

//I2C·ÖÁ¢²Ù×÷º¯Êý
extern bool I2C_Start(void);              //×ÜÏßÃ¦»î»ò³ö´íÔò·µ»Øfalse
extern void I2C_Stop(void);
extern void I2C_Ack(void);
extern void I2C_NoAck(void);
extern bool I2C_WaitAck(void); 	          //·µ»ØÎª:=1ÓÐACK,=0ÎÞACK
extern void I2C_SendByte(u8 SendByte);    //Êý¾Ý´Ó¸ßÎ»µ½µÍÎ»
extern uint8_t I2C_RadeByte(void);  //Êý¾Ý´Ó¸ßÎ»µ½µÍÎ»

//ÔÓÏîº¯Êý
extern void Delayms(uint32_t time);

/*************************************************************
************************* Æä Ëü ÔÓ Ïî ************************
*************************************************************/
//none
 
/******************************************************************************
***********************************   END  ************************************
******************************************************************************/
#ifdef __cplusplus
}
#endif

#endif



